#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.history_slicer_function.data.external.archive_prepare[0]: Reading...
module.charing_history_exporter_function.data.external.archive_prepare[0]: Reading...
module.lambda_layer_s3.data.external.archive_prepare[0]: Reading...
module.charing_history_exporter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_layer_s3.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.history_slicer_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=tesla-data-exporter-20230820121121249200000003]
aws_lambda_function.this: Refreshing state... [id=tesla-data-exporter]
module.lambda_layer_s3.data.aws_region.current: Reading...
data.aws_region.current: Reading...
aws_iam_role.this: Refreshing state... [id=tesla-data-exporter]
aws_lambda_permission.cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.this: Refreshing state... [id=tesla-data-exporter20230820121120523900000001-terraform-20230820121134874400000004]
aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/tesla-data-exporter]
aws_cloudwatch_event_rule.this: Refreshing state... [id=tesla-data-exporter20230820121120523900000001]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layer_s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_iam_policy.lambda: Refreshing state... [id=arn:aws:iam::402889198055:policy/tesla-data-exporter]
module.charing_history_exporter_function.data.aws_partition.current: Reading...
module.history_slicer_function.data.aws_caller_identity.current: Reading...
module.charing_history_exporter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.lambda_layer_s3.data.aws_caller_identity.current: Reading...
module.history_slicer_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.lambda_layer_s3.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
aws_ssm_parameter.email: Refreshing state... [id=/tesla-data-exporter/email]
module.history_slicer_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.charing_history_exporter_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.charing_history_exporter_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
data.aws_caller_identity.current: Reading...
aws_ssm_parameter.refresh_token: Refreshing state... [id=/tesla-data-exporter/refresh_token]
module.history_slicer_function.data.aws_partition.current: Reading...
module.lambda_layer_s3.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.history_slicer_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.charing_history_exporter_function.data.aws_caller_identity.current: Reading...
module.lambda_layer_s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_partition.current: Reading...
aws_s3_bucket.this: Refreshing state... [id=tesla-data-exporter20230820121120532200000002]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_region.current: Reading...
module.charing_history_exporter_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=7eb60e703ce476dda79c3026f9e3373dcf661ed201b4d53471100e2f29a9e43d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.history_exporter will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "history_exporter" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject*",
              + "s3:PutObject*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:us-east-1:402889198055:parameter/tesla-data-exporter/*",
            ]
        }
    }

  # data.aws_iam_policy_document.history_slicer will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "history_slicer" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_event_rule.exporter will be created
  + resource "aws_cloudwatch_event_rule" "exporter" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = (known after apply)
      + name_prefix         = "tesla-data-exporter"
      + schedule_expression = "rate(8 hours)"
      + tags_all            = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # aws_cloudwatch_event_rule.this will be destroyed
  # (because aws_cloudwatch_event_rule.this is not in configuration)
  - resource "aws_cloudwatch_event_rule" "this" {
      - arn                 = "arn:aws:events:us-east-1:402889198055:rule/tesla-data-exporter20230820121120523900000001" -> null
      - event_bus_name      = "default" -> null
      - id                  = "tesla-data-exporter20230820121120523900000001" -> null
      - is_enabled          = true -> null
      - name                = "tesla-data-exporter20230820121120523900000001" -> null
      - name_prefix         = "tesla-data-exporter" -> null
      - schedule_expression = "rate(8 hours)" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "Owner"      = "cvanlaw/tesla-data-lambda"
          - "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        } -> null
    }

  # aws_cloudwatch_event_target.exporter will be created
  + resource "aws_cloudwatch_event_target" "exporter" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.this will be destroyed
  # (because aws_cloudwatch_event_target.this is not in configuration)
  - resource "aws_cloudwatch_event_target" "this" {
      - arn            = "arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter" -> null
      - event_bus_name = "default" -> null
      - id             = "tesla-data-exporter20230820121120523900000001-terraform-20230820121134874400000004" -> null
      - rule           = "tesla-data-exporter20230820121120523900000001" -> null
      - target_id      = "terraform-20230820121134874400000004" -> null
    }

  # aws_cloudwatch_log_group.this will be destroyed
  # (because aws_cloudwatch_log_group.this is not in configuration)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:us-east-1:402889198055:log-group:/aws/lambda/tesla-data-exporter" -> null
      - id                = "/aws/lambda/tesla-data-exporter" -> null
      - name              = "/aws/lambda/tesla-data-exporter" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Owner"      = "cvanlaw/tesla-data-lambda"
          - "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        } -> null
    }

  # aws_iam_policy.lambda will be destroyed
  # (because aws_iam_policy.lambda is not in configuration)
  - resource "aws_iam_policy" "lambda" {
      - arn         = "arn:aws:iam::402889198055:policy/tesla-data-exporter" -> null
      - description = "IAM policy for tesla-data-exporter" -> null
      - id          = "arn:aws:iam::402889198055:policy/tesla-data-exporter" -> null
      - name        = "tesla-data-exporter" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:402889198055:log-group:/aws/lambda/tesla-data-exporter*",
                          - "arn:aws:logs:us-east-1:402889198055:log-group:/aws/lambda/tesla-data-exporter",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject*",
                          - "s3:GetObject*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::tesla-data-exporter20230820121120532200000002*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:us-east-1:402889198055:parameter/tesla-data-exporter/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAV3TQRJHTVOYSMGPB5" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Owner"      = "cvanlaw/tesla-data-lambda"
          - "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        } -> null
    }

  # aws_iam_role.this will be destroyed
  # (because aws_iam_role.this is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::402889198055:role/tesla-data-exporter" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-08-20T12:11:20Z" -> null
      - force_detach_policies = false -> null
      - id                    = "tesla-data-exporter" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::402889198055:policy/tesla-data-exporter",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "tesla-data-exporter" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-09-17T04:16:34Z"
              - region         = "us-east-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Owner"      = "cvanlaw/tesla-data-lambda"
          - "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        } -> null
      - unique_id             = "AROAV3TQRJHT25QFTZUMU" -> null
    }

  # aws_iam_role_policy_attachment.lambda_logs will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_logs is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_logs" {
      - id         = "tesla-data-exporter-20230820121121249200000003" -> null
      - policy_arn = "arn:aws:iam::402889198055:policy/tesla-data-exporter" -> null
      - role       = "tesla-data-exporter" -> null
    }

  # aws_lambda_function.this will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter" -> null
      - filename                       = "lambda.zip" -> null
      - function_name                  = "tesla-data-exporter" -> null
      - handler                        = "function.handler" -> null
      - id                             = "tesla-data-exporter" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter/invocations" -> null
      - last_modified                  = "2023-08-22T15:56:41.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::402889198055:role/tesla-data-exporter" -> null
      - runtime                        = "python3.10" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "J9tZVHV/BnQ9gzEUa5wQ0S+FDYWHXBXSqQyzSaIRlZ4=" -> null
      - source_code_size               = 14215405 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Owner"      = "cvanlaw/tesla-data-lambda"
          - "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        } -> null
      - timeout                        = 15 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "BUCKET_NAME"             = "tesla-data-exporter20230820121120532200000002"
              - "EMAIL_SSM_PARAM_NAME"    = "/tesla-data-exporter/email"
              - "REFRESH_TOKEN_SSM_PARAM" = "/tesla-data-exporter/refresh_token"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_permission.cloudwatch will be destroyed
  # (because aws_lambda_permission.cloudwatch is not in configuration)
  - resource "aws_lambda_permission" "cloudwatch" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "tesla-data-exporter" -> null
      - id            = "AllowExecutionFromCloudWatch" -> null
      - principal     = "events.amazonaws.com" -> null
      - source_arn    = "arn:aws:events:us-east-1:402889198055:rule/tesla-data-exporter20230820121120523900000001" -> null
      - statement_id  = "AllowExecutionFromCloudWatch" -> null
    }

  # aws_s3_bucket_notification.slicer will be created
  + resource "aws_s3_bucket_notification" "slicer" {
      + bucket      = "tesla-data-exporter20230820121120532200000002"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "charge_history/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.charing_history_exporter_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/tesla-data-exporter"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # module.charing_history_exporter_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "tesla-data-exporter-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # module.charing_history_exporter_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tesla-data-exporter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.charing_history_exporter_function.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tesla-data-exporter"
    }

  # module.charing_history_exporter_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Export charging history"
      + filename                       = "./.terraform/lambda_builds/5a4c88fdafc6b51b02b43d4ae31adb9376010ac30962cd01a73eaa2a56c4b6f2.zip"
      + function_name                  = "tesla-data-exporter"
      + handler                        = "function.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}
    }

  # module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tesla-data-exporter"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = (known after apply)
      + statement_id        = "EveryEightHours"
      + statement_id_prefix = (known after apply)
    }

  # module.charing_history_exporter_function.aws_lambda_permission.unqualified_alias_triggers["EveryEightHours"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tesla-data-exporter"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "EveryEightHours"
      + statement_id_prefix = (known after apply)
    }

  # module.charing_history_exporter_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/src/export_history.py",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/5a4c88fdafc6b51b02b43d4ae31adb9376010ac30962cd01a73eaa2a56c4b6f2.zip"
              + runtime       = "python3.10"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/5a4c88fdafc6b51b02b43d4ae31adb9376010ac30962cd01a73eaa2a56c4b6f2.plan.json"
      + id                   = (known after apply)
    }

  # module.charing_history_exporter_function.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "./.terraform/lambda_builds/5a4c88fdafc6b51b02b43d4ae31adb9376010ac30962cd01a73eaa2a56c4b6f2.zip"
          + "timestamp" = "1694952906742778000"
        }
    }

  # module.dynamodb_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "timestamp"
      + id               = (known after apply)
      + name             = "tde-slicer"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "tde-slicer"
        }
      + tags_all         = {
          + "Name"       = "tde-slicer"
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "timestamp"
          + type = "N"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled = false
        }
    }

  # module.history_slicer_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.history_slicer_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/history-slicer"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # module.history_slicer_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "history-slicer-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # module.history_slicer_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "history-slicer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.history_slicer_function.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "history-slicer"
    }

  # module.history_slicer_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Slice charging history"
      + filename                       = "./.terraform/lambda_builds/a576bce498f5c35fe1078e38cbd496f2210a781d888bed746428731e57312d32.zip"
      + function_name                  = "history-slicer"
      + handler                        = "function.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "tde-slicer"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}
    }

  # module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "history-slicer"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:s3:::tesla-data-exporter20230820121120532200000002"
      + statement_id        = "s3"
      + statement_id_prefix = (known after apply)
    }

  # module.history_slicer_function.aws_lambda_permission.unqualified_alias_triggers["s3"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "history-slicer"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::tesla-data-exporter20230820121120532200000002"
      + statement_id        = "s3"
      + statement_id_prefix = (known after apply)
    }

  # module.history_slicer_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/src/slice_history.py",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/a576bce498f5c35fe1078e38cbd496f2210a781d888bed746428731e57312d32.zip"
              + runtime       = "python3.10"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/a576bce498f5c35fe1078e38cbd496f2210a781d888bed746428731e57312d32.plan.json"
      + id                   = (known after apply)
    }

  # module.history_slicer_function.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "./.terraform/lambda_builds/a576bce498f5c35fe1078e38cbd496f2210a781d888bed746428731e57312d32.zip"
          + "timestamp" = "1694952906795549000"
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.10",
        ]
      + created_date                = (known after apply)
      + description                 = "Dependencies for tesla-data-exporter"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "tesla-data-exporter-dependencies"
      + s3_bucket                   = "tesla-data-exporter"
      + s3_key                      = "lambda-builds/3eb6252338a2c995550dce6a460f0e76e71a612dd9b03505c13f8b95036ad2d8.zip"
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + bucket                 = "tesla-data-exporter"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambda-builds/3eb6252338a2c995550dce6a460f0e76e71a612dd9b03505c13f8b95036ad2d8.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./.terraform/lambda_builds/3eb6252338a2c995550dce6a460f0e76e71a612dd9b03505c13f8b95036ad2d8.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + version_id             = (known after apply)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/packages",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/3eb6252338a2c995550dce6a460f0e76e71a612dd9b03505c13f8b95036ad2d8.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/3eb6252338a2c995550dce6a460f0e76e71a612dd9b03505c13f8b95036ad2d8.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "./.terraform/lambda_builds/3eb6252338a2c995550dce6a460f0e76e71a612dd9b03505c13f8b95036ad2d8.zip"
          + "timestamp" = "1694952906746496000"
        }
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tesla-data-exporter"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 31 to add, 0 to change, 8 to destroy.

Changes to Outputs:
  ~ bucket_name = "tesla-data-exporter20230820121120532200000002" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @cvanlaw, Action: `pull_request`*